# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\MIHAILO\Documents\PSoC Creator\PSoC101\TEAMPROJECT.cydsn\TEAMPROJECT.cyprj
# Date: Fri, 03 Nov 2023 14:05:13 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 875 -waveform {0 437.5} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {EZI2C_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 21 43} [list]
create_generated_clock -name {Sound4} -source [get_pins {ClockBlock/hfclk}] -edges {1 58537 117075} -nominal_period 2439041.6666666665 [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {Sound1} -source [get_pins {ClockBlock/hfclk}] -edges {1 28917 57833} -nominal_period 1204833.3333333333 [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {Sound3} -source [get_pins {ClockBlock/hfclk}] -edges {1 47619 95239} [list [get_pins {ClockBlock/udb_div_2}]]
create_generated_clock -name {Sound2} -source [get_pins {ClockBlock/hfclk}] -edges {1 38711 77421} -nominal_period 1612916.6666666665 [list [get_pins {ClockBlock/udb_div_3}]]
create_generated_clock -name {EZI2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]


# Component constraints for C:\Users\MIHAILO\Documents\PSoC Creator\PSoC101\TEAMPROJECT.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\MIHAILO\Documents\PSoC Creator\PSoC101\TEAMPROJECT.cydsn\TEAMPROJECT.cyprj
# Date: Fri, 03 Nov 2023 14:05:09 GMT
