# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\MIHAILO\Documents\PSoC Creator\PSoC101\Lab01.cydsn\Lab01.cyprj
# Date: Thu, 02 Nov 2023 13:18:29 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 875 -waveform {0 437.5} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 21 43} [list]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 400001 800001} [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for C:\Users\MIHAILO\Documents\PSoC Creator\PSoC101\Lab01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\MIHAILO\Documents\PSoC Creator\PSoC101\Lab01.cydsn\Lab01.cyprj
# Date: Thu, 02 Nov 2023 13:18:25 GMT
